/* ---------------------------------------------------------------- */
/* IMQBLDC - iMoq command processing program for IMOQBUILD          */
/* ---------------------------------------------------------------- */
             PGM        PARM(&OBJ)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&HITLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MOCKLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TEXT) TYPE(*CHAR) LEN(50)
             DCL        VAR(&OBJTYPE) TYPE(*CHAR) LEN(10) +
                          VALUE('*SRVPGM')
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(529)
             DCL        VAR(&ERRID) TYPE(*CHAR) LEN(7) STG(*DEFINED) +
                          DEFVAR(&ERR 1)
             DCL        VAR(&ERRLIB) TYPE(*CHAR) LEN(10) STG(*DEFINED) +
                          DEFVAR(&ERR 8)
             DCL        VAR(&ERRTXT) TYPE(*CHAR) LEN(512) STG(*DEFINED) +
                          DEFVAR(&ERR 18)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&CLMSGID) TYPE(*CHAR) LEN(7)

             MONMSG     MSGID(CPF0000 MCH0000 RNS0000) +
                          EXEC(GOTO CMDLBL(FAIL))

             CALLSUBR   SUBR(SRCMBR)
/* Binder source member (generated here for SRCFILE(*NONE) mocks)   */
             CRTSRCPF   FILE(QTEMP/IMOQBND) RCDLEN(240) +
                          TEXT('iMoq binder source')
             MONMSG     MSGID(CPF7302)
             ADDPFM     FILE(QTEMP/IMOQBND) MBR(&OBJ) SRCTYPE(BND)
             MONMSG     MSGID(CPF5812 CPF7306)
             CALLPRC    PRC('IMOQ_CL_GENSRV') PARM((&OBJ) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             CALLPRC    PRC('IMOQ_CL_MOCKLIB') PARM((&OBJ) (&MOCKLIB) +
                          (&ERR))

             CRTRPGMOD  MODULE(QTEMP/&OBJ) SRCFILE(QTEMP/IMOQSRC) +
                          SRCMBR(&OBJ) OUTPUT(*NONE)
             MONMSG     MSGID(RNS9309) EXEC(DO)
             CRTRPGMOD  MODULE(QTEMP/&OBJ) SRCFILE(QTEMP/IMOQSRC) +
                          SRCMBR(&OBJ) OUTPUT(*PRINT)
             MONMSG     MSGID(RNS9309)
             CHGVAR     VAR(&MSG) VALUE('The stub for' *BCAT &OBJ +
                          *BCAT 'did not compile. See the spooled +
                          listing and QTEMP/IMOQSRC.')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0015')
             GOTO       CMDLBL(CLERR)
             ENDDO

             CHGVAR     VAR(&CLMSGID) VALUE(' ')
             CALLSUBR   SUBR(DLTMOCK)
             IF         COND(&CLMSGID *NE ' ') THEN(GOTO CMDLBL(CLERR))
             CRTSRVPGM  SRVPGM(&MOCKLIB/&OBJ) MODULE(QTEMP/&OBJ) +
                          EXPORT(*SRCFILE) SRCFILE(QTEMP/IMOQBND) +
                          SRCMBR(&OBJ) BNDSRVPGM((&ERRLIB/IMOQENG)) +
                          ACTGRP(*CALLER) TEXT('iMoq mock')
             MONMSG     MSGID(CPF5D05) EXEC(DO)
             CHGVAR     VAR(&MSG) VALUE('CRTSRVPGM failed for mock' +
                          *BCAT &OBJ *TCAT '. See the job log.')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0015')
             GOTO       CMDLBL(CLERR)
             ENDDO
             DLTMOD     MODULE(QTEMP/&OBJ)
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&CLMSGID) VALUE(' ')
             CALLSUBR   SUBR(CHKHIDE)
             IF         COND(&CLMSGID *NE ' ') THEN(GOTO CMDLBL(CLERR))

             CALLPRC    PRC('IMOQ_CL_SETBUILT') PARM((&OBJ) (&ERR))
             CHGVAR     VAR(&MSG) VALUE('Service program mock' +
                          *BCAT &MOCKLIB *TCAT '/' *TCAT &OBJ *BCAT +
                          'built')
             SNDPGMMSG  MSGID(IMQ0001) MSGF(&ERRLIB/IMOQMSGF) +
                          MSGDTA(&MSG) MSGTYPE(*COMP)
             RETURN



/* ---- error exits ------------------------------------------------ */
 MOCKERR:    SNDPGMMSG  MSGID(&ERRID) MSGF(&ERRLIB/IMOQMSGF) +
                          MSGDTA(&ERRTXT) MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

 CLERR:      CALLPRC    PRC('IMOQ_CL_FAIL') PARM((&CLMSGID) (&MSG) (&ERR))
             MONMSG     MSGID(CPF0000 MCH0000)
             SNDPGMMSG  MSGID(&CLMSGID) MSGF(&ERRLIB/IMOQMSGF) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000) EXEC(SNDPGMMSG MSGID(CPF9898) +
                          MSGF(QCPFMSG) MSGDTA(&MSG) MSGTYPE(*ESCAPE))
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*YES) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0015')
             GOTO       CMDLBL(CLERR)

/* ---- ensure QTEMP/IMOQSRC(&OBJ) exists and is empty ------------ */
             SUBR       SUBR(SRCMBR)
             CRTSRCPF   FILE(QTEMP/IMOQSRC) RCDLEN(240) +
                          TEXT('iMoq generated stubs')
             MONMSG     MSGID(CPF7302)
             ADDPFM     FILE(QTEMP/IMOQSRC) MBR(&OBJ) SRCTYPE(RPGLE)
             MONMSG     MSGID(CPF5812 CPF7306) EXEC(CLRPFM +
                          FILE(QTEMP/IMOQSRC) MBR(&OBJ))
             ENDSUBR

/* ---- the mock must be the first match in the library list ------ */
             SUBR       SUBR(CHKHIDE)
             CHGVAR     VAR(&HITLIB) VALUE(' ')
             RTVOBJD    OBJ(*LIBL/&OBJ) OBJTYPE(&OBJTYPE) RTNLIB(&HITLIB)
             MONMSG     MSGID(CPF9800)
             IF         COND(&HITLIB *EQ ' ') THEN(DO)
             CHGVAR     VAR(&MSG) VALUE('Mock' *BCAT &MOCKLIB *TCAT +
                          '/' *TCAT &OBJ *BCAT 'cannot be found +
                          through the library list. Add library' +
                          *BCAT &MOCKLIB *BCAT 'to the library list.')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0010')
             ENDDO
             ELSE       CMD(IF COND(&HITLIB *NE &MOCKLIB) THEN(DO))
             CHGVAR     VAR(&MSG) VALUE('Mock' *BCAT &MOCKLIB *TCAT +
                          '/' *TCAT &OBJ *BCAT 'is hidden by' *BCAT +
                          &HITLIB *TCAT '/' *TCAT &OBJ *TCAT ', which +
                          comes first in the library list. Put' +
                          *BCAT &HITLIB *BCAT 'after' *BCAT &MOCKLIB +
                          *TCAT '. The current library is searched +
                          before QTEMP; for example CHGCURLIB +
                          CURLIB(*CRTDFT) then ADDLIBLE' *BCAT +
                          &HITLIB *BCAT '*LAST.')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0010')
             ENDDO
             ENDSUBR
/* ---- delete an earlier mock; never replace a real object ------- */
             SUBR       SUBR(DLTMOCK)
             CHGVAR     VAR(&TEXT) VALUE('*NOTFOUND')
             RTVOBJD    OBJ(&MOCKLIB/&OBJ) OBJTYPE(&OBJTYPE) TEXT(&TEXT)
             MONMSG     MSGID(CPF9800) EXEC(CHGVAR VAR(&TEXT) +
                          VALUE('*NOTFOUND'))
             IF         COND(&TEXT *EQ '*NOTFOUND') THEN(RTNSUBR)
             IF         COND(&MOCKLIB *NE 'QTEMP' *AND &TEXT *NE +
                          'iMoq mock') THEN(DO)
             CHGVAR     VAR(&MSG) VALUE(&MOCKLIB *TCAT '/' *TCAT &OBJ +
                          *BCAT 'already exists and is not an +
                          iMoq mock, so it will not be replaced. +
                          Create the mock in another library with +
                          LIB().')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0016')
             RTNSUBR
             ENDDO
             IF         COND(&OBJTYPE *EQ '*PGM') THEN(DLTPGM +
                          PGM(&MOCKLIB/&OBJ))
             ELSE       CMD(DLTSRVPGM SRVPGM(&MOCKLIB/&OBJ))
             ENDSUBR
             ENDPGM
