/* ---------------------------------------------------------------- */
/* IMQRMVC - iMoq command processing program for IMOQRMV            */
/* ---------------------------------------------------------------- */
             PGM        PARM(&OBJ)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIST) TYPE(*CHAR) LEN(5400)
             DCL        VAR(&MLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TEXT) TYPE(*CHAR) LEN(50)
             DCL        VAR(&CNT) TYPE(*INT) LEN(4)
             DCL        VAR(&I) TYPE(*INT) LEN(4)
             DCL        VAR(&POS) TYPE(*INT) LEN(4)
             DCL        VAR(&NAME) TYPE(*CHAR) LEN(10)
             DCL        VAR(&TYPE) TYPE(*CHAR) LEN(7)
             DCL        VAR(&NBR) TYPE(*CHAR) LEN(4)
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(529)
             DCL        VAR(&ERRID) TYPE(*CHAR) LEN(7) STG(*DEFINED) +
                          DEFVAR(&ERR 1)
             DCL        VAR(&ERRLIB) TYPE(*CHAR) LEN(10) STG(*DEFINED) +
                          DEFVAR(&ERR 8)
             DCL        VAR(&ERRTXT) TYPE(*CHAR) LEN(512) STG(*DEFINED) +
                          DEFVAR(&ERR 18)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&CLMSGID) TYPE(*CHAR) LEN(7)

             MONMSG     MSGID(CPF0000 MCH0000) +
                          EXEC(GOTO CMDLBL(FAIL))

             CALLPRC    PRC('IMOQ_CL_LIST') PARM((&OBJ) (&LIST) +
                          (&CNT) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             IF         COND(&OBJ *NE '*ALL' *AND &CNT *EQ 0) THEN(DO)
             CHGVAR     VAR(&MSG) VALUE('Mock' *BCAT &OBJ *BCAT +
                          'does not exist')
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0011')
             GOTO       CMDLBL(CLERR)
             ENDDO

             DOFOR      VAR(&I) FROM(1) TO(&CNT)
             CHGVAR     VAR(&POS) VALUE((&I - 1) * 27 + 1)
             CHGVAR     VAR(&NAME) VALUE(%SST(&LIST &POS 10))
             CHGVAR     VAR(&POS) VALUE(&POS + 10)
             CHGVAR     VAR(&TYPE) VALUE(%SST(&LIST &POS 7))
             CHGVAR     VAR(&POS) VALUE(&POS + 7)
             CHGVAR     VAR(&MLIB) VALUE(%SST(&LIST &POS 10))
/* Only delete objects that are iMoq mocks */
             CHGVAR     VAR(&TEXT) VALUE(' ')
             RTVOBJD    OBJ(&MLIB/&NAME) OBJTYPE(&TYPE) TEXT(&TEXT)
             MONMSG     MSGID(CPF0000)
             IF         COND(&MLIB *EQ 'QTEMP' *OR &TEXT *EQ +
                          'iMoq mock') THEN(DO)
             IF         COND(&TYPE *EQ '*PGM') THEN(DO)
             DLTPGM     PGM(&MLIB/&NAME)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ELSE       CMD(DO)
             DLTSRVPGM  SRVPGM(&MLIB/&NAME)
             MONMSG     MSGID(CPF0000)
             ENDDO
             ENDDO
             IF         COND(&TYPE *NE '*PGM') THEN(DO)
             RMVM       FILE(QTEMP/IMOQBND) MBR(&NAME)
             MONMSG     MSGID(CPF0000)
             ENDDO
             RMVM       FILE(QTEMP/IMOQSRC) MBR(&NAME)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CALLPRC    PRC('IMOQ_CL_FORGET') PARM((&OBJ) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             IF         COND(&OBJ *EQ '*ALL') THEN(DO)
             DLTF       FILE(QTEMP/IMOQSRC)
             MONMSG     MSGID(CPF0000)
             DLTF       FILE(QTEMP/IMOQBND)
             MONMSG     MSGID(CPF0000)
             ENDDO

             CHGVAR     VAR(&NBR) VALUE(%CHAR(&CNT))
             CHGVAR     VAR(&MSG) VALUE(%TRIM(&NBR) *BCAT 'imoq(s) +
                          removed. Programs that already activated +
                          a mock keep using it until their +
                          activation group ends (RCLACTGRP).')
             SNDPGMMSG  MSGID(IMQ0001) MSGF(&ERRLIB/IMOQMSGF) +
                          MSGDTA(&MSG) MSGTYPE(*COMP)
             RETURN

/* ---- error exits ------------------------------------------------ */
 MOCKERR:    SNDPGMMSG  MSGID(&ERRID) MSGF(&ERRLIB/IMOQMSGF) +
                          MSGDTA(&ERRTXT) MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

 CLERR:      CALLPRC    PRC('IMOQ_CL_FAIL') PARM((&CLMSGID) (&MSG) (&ERR))
             MONMSG     MSGID(CPF0000 MCH0000)
             SNDPGMMSG  MSGID(&CLMSGID) MSGF(&ERRLIB/IMOQMSGF) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000) EXEC(SNDPGMMSG MSGID(CPF9898) +
                          MSGF(QCPFMSG) MSGDTA(&MSG) MSGTYPE(*ESCAPE))
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*YES) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&CLMSGID) VALUE('IMQ0015')
             GOTO       CMDLBL(CLERR)
             ENDPGM
