/* ---------------------------------------------------------------- */
/* MCKPRCC - IBMIMOCK command processing program for MOCKPROC       */
/* ---------------------------------------------------------------- */
             PGM        PARM(&OBJ &PROC &RTN &PARMS)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PROC) TYPE(*CHAR) LEN(258)
             DCL        VAR(&RTN) TYPE(*CHAR) LEN(20)
             DCL        VAR(&PARMS) TYPE(*CHAR) LEN(2000)
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(529)
             DCL        VAR(&ERRID) TYPE(*CHAR) LEN(7) STG(*DEFINED) +
                          DEFVAR(&ERR 1)
             DCL        VAR(&ERRLIB) TYPE(*CHAR) LEN(10) STG(*DEFINED) +
                          DEFVAR(&ERR 8)
             DCL        VAR(&ERRTXT) TYPE(*CHAR) LEN(512) STG(*DEFINED) +
                          DEFVAR(&ERR 18)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&CLMSGID) TYPE(*CHAR) LEN(7)

             MONMSG     MSGID(CPF0000 MCH0000) +
                          EXEC(GOTO CMDLBL(FAIL))

             CALLPRC    PRC('MOCK_CL_DEFPROC') PARM((&OBJ) (&PROC) +
                          (&RTN) (&PARMS) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             CHGVAR     VAR(&MSG) VALUE('Procedure' *BCAT &ERRTXT +
                          *TCAT ' declared for mock' *BCAT &OBJ)
             SNDPGMMSG  MSGID(MCK0001) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&MSG) MSGTYPE(*COMP)
             RETURN

/* ---- error exits ------------------------------------------------ */
 MOCKERR:    SNDPGMMSG  MSGID(&ERRID) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&ERRTXT) MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

 CLERR:      CALLPRC    PRC('MOCK_CL_FAIL') PARM((&CLMSGID) (&MSG) (&ERR))
             MONMSG     MSGID(CPF0000 MCH0000)
             SNDPGMMSG  MSGID(&CLMSGID) MSGF(&ERRLIB/MOCKMSGF) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000) EXEC(SNDPGMMSG MSGID(CPF9898) +
                          MSGF(QCPFMSG) MSGDTA(&MSG) MSGTYPE(*ESCAPE))
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*YES) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0015')
             GOTO       CMDLBL(CLERR)
             ENDPGM
