/* ---------------------------------------------------------------- */
/* MCKPGMC - RPGMOCK command processing program for MOCKPGM         */
/* ---------------------------------------------------------------- */
             PGM        PARM(&OBJ &PARMS &BEHAVIOR)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PARMS) TYPE(*CHAR) LEN(2000)
             DCL        VAR(&BEHAVIOR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&REALLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&HITLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&OBJTYPE) TYPE(*CHAR) LEN(10) VALUE('*PGM')
             DCL        VAR(&INFO) TYPE(*CHAR) LEN(512)
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(529)
             DCL        VAR(&ERRID) TYPE(*CHAR) LEN(7) STG(*DEFINED) +
                          DEFVAR(&ERR 1)
             DCL        VAR(&ERRLIB) TYPE(*CHAR) LEN(10) STG(*DEFINED) +
                          DEFVAR(&ERR 8)
             DCL        VAR(&ERRTXT) TYPE(*CHAR) LEN(512) STG(*DEFINED) +
                          DEFVAR(&ERR 18)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&CLMSGID) TYPE(*CHAR) LEN(7)

             MONMSG     MSGID(CPF0000 MCH0000 RNS0000) +
                          EXEC(GOTO CMDLBL(FAIL))

/* Remove an earlier mock so the real object can be located */
             DLTPGM     PGM(QTEMP/&OBJ)
             MONMSG     MSGID(CPF2105)
             CHGVAR     VAR(&REALLIB) VALUE('*NONE')
             RTVOBJD    OBJ(*LIBL/&OBJ) OBJTYPE(*PGM) RTNLIB(&REALLIB)
             MONMSG     MSGID(CPF9800) EXEC(CHGVAR VAR(&REALLIB) +
                          VALUE('*NONE'))

             CALLSUBR   SUBR(SRCMBR)
             CALLPRC    PRC('MOCK_CL_DEFPGM') PARM((&OBJ) (&BEHAVIOR) +
                          (&PARMS) (&REALLIB) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             CHGVAR     VAR(&INFO) VALUE(&ERRTXT)

             CRTRPGMOD  MODULE(QTEMP/&OBJ) SRCFILE(QTEMP/MOCKSRC) +
                          SRCMBR(&OBJ) OUTPUT(*NONE)
             MONMSG     MSGID(RNS9309) EXEC(DO)
             CRTRPGMOD  MODULE(QTEMP/&OBJ) SRCFILE(QTEMP/MOCKSRC) +
                          SRCMBR(&OBJ) OUTPUT(*PRINT)
             MONMSG     MSGID(RNS9309)
             CHGVAR     VAR(&MSG) VALUE('The stub for' *BCAT &OBJ +
                          *BCAT 'did not compile. See the spooled +
                          listing and QTEMP/MOCKSRC.')
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0015')
             GOTO       CMDLBL(CLERR)
             ENDDO
             CRTPGM     PGM(QTEMP/&OBJ) MODULE(QTEMP/&OBJ) +
                          BNDSRVPGM((&ERRLIB/MOCKENG)) ACTGRP(*CALLER)
             DLTMOD     MODULE(QTEMP/&OBJ)
             MONMSG     MSGID(CPF0000)

             CHGVAR     VAR(&CLMSGID) VALUE(' ')
             CALLSUBR   SUBR(CHKHIDE)
             IF         COND(&CLMSGID *NE ' ') THEN(GOTO CMDLBL(CLERR))

             CALLPRC    PRC('MOCK_CL_SETBUILT') PARM((&OBJ) (&ERR))
             CHGVAR     VAR(&MSG) VALUE('Program mock QTEMP/' *CAT +
                          &OBJ *TCAT ' created:' *BCAT &INFO)
             SNDPGMMSG  MSGID(MCK0001) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&MSG) MSGTYPE(*COMP)
             RETURN



/* ---- error exits ------------------------------------------------ */
 MOCKERR:    SNDPGMMSG  MSGID(&ERRID) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&ERRTXT) MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

 CLERR:      CALLPRC    PRC('MOCK_CL_FAIL') PARM((&CLMSGID) (&MSG) (&ERR))
             MONMSG     MSGID(CPF0000 MCH0000)
             SNDPGMMSG  MSGID(&CLMSGID) MSGF(&ERRLIB/MOCKMSGF) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000) EXEC(SNDPGMMSG MSGID(CPF9898) +
                          MSGF(QCPFMSG) MSGDTA(&MSG) MSGTYPE(*ESCAPE))
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*YES) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0015')
             GOTO       CMDLBL(CLERR)

/* ---- ensure QTEMP/MOCKSRC(&OBJ) exists and is empty ------------ */
             SUBR       SUBR(SRCMBR)
             CRTSRCPF   FILE(QTEMP/MOCKSRC) RCDLEN(240) +
                          TEXT('RPGMOCK generated stubs')
             MONMSG     MSGID(CPF7302)
             ADDPFM     FILE(QTEMP/MOCKSRC) MBR(&OBJ) SRCTYPE(RPGLE)
             MONMSG     MSGID(CPF5812 CPF7306) EXEC(CLRPFM +
                          FILE(QTEMP/MOCKSRC) MBR(&OBJ))
             ENDSUBR

/* ---- the mock must be the first match in the library list ------ */
             SUBR       SUBR(CHKHIDE)
             CHGVAR     VAR(&HITLIB) VALUE(' ')
             RTVOBJD    OBJ(*LIBL/&OBJ) OBJTYPE(&OBJTYPE) RTNLIB(&HITLIB)
             MONMSG     MSGID(CPF9800)
             IF         COND(&HITLIB *NE 'QTEMP') THEN(DO)
             CHGVAR     VAR(&MSG) VALUE('Mock' *BCAT &OBJ *BCAT +
                          'is hidden by' *BCAT &HITLIB *TCAT '/' *TCAT +
                          &OBJ *TCAT ', which is ahead of QTEMP in the' +
                          *BCAT 'library list. Put that library after' +
                          *BCAT 'QTEMP, for example CHGCURLIB' *BCAT +
                          'CURLIB(*CRTDFT) then ADDLIBLE' *BCAT +
                          &HITLIB *BCAT '*LAST.')
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0010')
             ENDDO
             ENDSUBR
             ENDPGM
