/* ---------------------------------------------------------------- */
/* MCKSRVC - IBMIMOCK command processing program for MOCKSRVPGM     */
/* ---------------------------------------------------------------- */
             PGM        PARM(&OBJ &BEHAVIOR &SRCQ &SRCMBR)
             DCL        VAR(&OBJ) TYPE(*CHAR) LEN(10)
             DCL        VAR(&BEHAVIOR) TYPE(*CHAR) LEN(7)
             DCL        VAR(&SRCQ) TYPE(*CHAR) LEN(20)
             DCL        VAR(&SRCFILE) TYPE(*CHAR) LEN(10) +
                          STG(*DEFINED) DEFVAR(&SRCQ 1)
             DCL        VAR(&SRCLIB) TYPE(*CHAR) LEN(10) +
                          STG(*DEFINED) DEFVAR(&SRCQ 11)
             DCL        VAR(&SRCMBR) TYPE(*CHAR) LEN(10)
             DCL        VAR(&REALLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&ERR) TYPE(*CHAR) LEN(529)
             DCL        VAR(&ERRID) TYPE(*CHAR) LEN(7) STG(*DEFINED) +
                          DEFVAR(&ERR 1)
             DCL        VAR(&ERRLIB) TYPE(*CHAR) LEN(10) STG(*DEFINED) +
                          DEFVAR(&ERR 8)
             DCL        VAR(&ERRTXT) TYPE(*CHAR) LEN(512) STG(*DEFINED) +
                          DEFVAR(&ERR 18)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&CLMSGID) TYPE(*CHAR) LEN(7)

             MONMSG     MSGID(CPF0000 MCH0000) +
                          EXEC(GOTO CMDLBL(FAIL))

             DLTSRVPGM  SRVPGM(QTEMP/&OBJ)
             MONMSG     MSGID(CPF2105)
             CHGVAR     VAR(&REALLIB) VALUE('*NONE')
             RTVOBJD    OBJ(*LIBL/&OBJ) OBJTYPE(*SRVPGM) +
                          RTNLIB(&REALLIB)
             MONMSG     MSGID(CPF9800) EXEC(CHGVAR VAR(&REALLIB) +
                          VALUE('*NONE'))

             CRTSRCPF   FILE(QTEMP/MOCKBND) RCDLEN(240) +
                          TEXT('IBMIMOCK binder source')
             MONMSG     MSGID(CPF7302)
             RMVM       FILE(QTEMP/MOCKBND) MBR(&OBJ)
             MONMSG     MSGID(CPF0000)

             IF         COND(&SRCFILE *EQ '*RTV') THEN(DO)
             IF         COND(&REALLIB *EQ '*NONE') THEN(DO)
             CHGVAR     VAR(&MSG) VALUE('Service program' *BCAT &OBJ +
                          *BCAT 'was not found in the library list, +
                          so its exports cannot be retrieved. Add +
                          its library or pass SRCFILE/SRCMBR with +
                          its binder source.')
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0013')
             GOTO       CMDLBL(CLERR)
             ENDDO
             RTVBNDSRC  SRVPGM(&REALLIB/&OBJ) SRCFILE(QTEMP/MOCKBND) +
                          SRCMBR(&OBJ) MBROPT(*REPLACE)
             ENDDO
             ELSE       CMD(DO)
             IF         COND(&SRCMBR *EQ '*OBJ') THEN(CHGVAR +
                          VAR(&SRCMBR) VALUE(&OBJ))
             CPYSRCF    FROMFILE(&SRCLIB/&SRCFILE) TOFILE(QTEMP/MOCKBND) +
                          FROMMBR(&SRCMBR) TOMBR(&OBJ) MBROPT(*REPLACE)
             ENDDO

             CALLPRC    PRC('MOCK_CL_DEFSRV') PARM((&OBJ) (&BEHAVIOR) +
                          (&REALLIB) (&ERR))
             IF         COND(&ERRID *NE ' ') THEN(GOTO CMDLBL(MOCKERR))
             CHGVAR     VAR(&MSG) VALUE('Service program mock' *BCAT +
                          &OBJ *BCAT 'started:' *BCAT &ERRTXT *TCAT +
                          '. Declare procedures with MOCKPROC, then +
                          run MOCKBUILD.')
             SNDPGMMSG  MSGID(MCK0001) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&MSG) MSGTYPE(*COMP)
             RETURN

/* ---- error exits ------------------------------------------------ */
 MOCKERR:    SNDPGMMSG  MSGID(&ERRID) MSGF(&ERRLIB/MOCKMSGF) +
                          MSGDTA(&ERRTXT) MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

 CLERR:      CALLPRC    PRC('MOCK_CL_FAIL') PARM((&CLMSGID) (&MSG) (&ERR))
             MONMSG     MSGID(CPF0000 MCH0000)
             SNDPGMMSG  MSGID(&CLMSGID) MSGF(&ERRLIB/MOCKMSGF) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000) EXEC(SNDPGMMSG MSGID(CPF9898) +
                          MSGF(QCPFMSG) MSGDTA(&MSG) MSGTYPE(*ESCAPE))
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*YES) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&CLMSGID) VALUE('MCK0015')
             GOTO       CMDLBL(CLERR)
             ENDPGM
