/* ---------------------------------------------------------------- */
/* MOCKINST - build IBMIMOCK into a library                         */
/*                                                                  */
/*   CALL MOCKINST PARM('IBMIMOCK' 'SRCLIB')                        */
/*   1: library to build into (default: current library)            */
/*   2: library holding QRPGLESRC, QCLLESRC, QCMDSRC and QSRVSRC    */
/*      (default: the build library)                                */
/* ---------------------------------------------------------------- */
             PGM        PARM(&PLIB &PSRCLIB)
             DCL        VAR(&PLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&PSRCLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&SRCLIB) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CPP) TYPE(*CHAR) LEN(10)
             DCL        VAR(&CMD) TYPE(*CHAR) LEN(10)
             DCL        VAR(&MSGF) TYPE(*CHAR) LEN(20)
             DCL        VAR(&MSG) TYPE(*CHAR) LEN(512)
             DCL        VAR(&STEP) TYPE(*CHAR) LEN(40)
             DCL        VAR(&INLIBL) TYPE(*LGL) VALUE('0')

             MONMSG     MSGID(CPF0000 MCH0000 RNS0000 SQL0000) +
                          EXEC(GOTO CMDLBL(FAIL))

             CHGJOB     INQMSGRPY(*DFT)
             RTVJOBA    CURLIB(&LIB)
             CHGVAR     VAR(&LIB) VALUE(&PLIB)
             MONMSG     MSGID(MCH3601)
             CHGVAR     VAR(&SRCLIB) VALUE(&LIB)
             CHGVAR     VAR(&SRCLIB) VALUE(&PSRCLIB)
             MONMSG     MSGID(MCH3601)

/* Make the library available without moving it ahead of QTEMP;    */
/* take it off the list again at the end if it was added here.      */
             ADDLIBLE   LIB(&LIB) POSITION(*LAST)
             MONMSG     MSGID(CPF2103) EXEC(CHGVAR VAR(&INLIBL) +
                          VALUE('1'))

/* Engine copybook is included from QTEMP so any source file works */
             CHGVAR     VAR(&STEP) VALUE('copybook')
             DLTF       FILE(QTEMP/MOCKINC)
             MONMSG     MSGID(CPF2105)
             CRTSRCPF   FILE(QTEMP/MOCKINC) RCDLEN(240)
             CPYSRCF    FROMFILE(&SRCLIB/QRPGLESRC) TOFILE(QTEMP/MOCKINC) +
                          FROMMBR(MOCKENG_H)

             CHGVAR     VAR(&STEP) VALUE('message file')
             CALLSUBR   SUBR(MSGFILE)

             CHGVAR     VAR(&STEP) VALUE('MOCKCDC module')
             CRTRPGMOD  MODULE(QTEMP/MOCKCDC) SRCFILE(&SRCLIB/QRPGLESRC) +
                          SRCMBR(MOCKCDC) DBGVIEW(*SOURCE)
             CHGVAR     VAR(&STEP) VALUE('MOCKENG module')
             CRTSQLRPGI OBJ(QTEMP/MOCKENG) SRCFILE(&SRCLIB/QRPGLESRC) +
                          SRCMBR(MOCKENG) COMMIT(*NONE) +
                          OBJTYPE(*MODULE) GENLVL(11) DBGVIEW(*SOURCE)
             CHGVAR     VAR(&STEP) VALUE('MOCKGEN module')
             CRTSQLRPGI OBJ(QTEMP/MOCKGEN) SRCFILE(&SRCLIB/QRPGLESRC) +
                          SRCMBR(MOCKGEN) COMMIT(*NONE) +
                          OBJTYPE(*MODULE) GENLVL(11) DBGVIEW(*SOURCE)
             CHGVAR     VAR(&STEP) VALUE('MOCKENG service program')
             DLTSRVPGM  SRVPGM(&LIB/MOCKENG)
             MONMSG     MSGID(CPF2105)
             CRTSRVPGM  SRVPGM(&LIB/MOCKENG) MODULE(QTEMP/MOCKCDC +
                          QTEMP/MOCKENG QTEMP/MOCKGEN) +
                          EXPORT(*SRCFILE) SRCFILE(&SRCLIB/QSRVSRC) +
                          SRCMBR(MOCKENG) ACTGRP(IBMIMOCK) +
                          TEXT('IBMIMOCK engine')

             CHGVAR     VAR(&CPP) VALUE('MCKPGMC')
             CHGVAR     VAR(&CMD) VALUE('MOCKPGM')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKSRVC')
             CHGVAR     VAR(&CMD) VALUE('MOCKSRVPGM')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKPRCC')
             CHGVAR     VAR(&CMD) VALUE('MOCKPROC')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKBLDC')
             CHGVAR     VAR(&CMD) VALUE('MOCKBUILD')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKWHNC')
             CHGVAR     VAR(&CMD) VALUE('MOCKWHEN')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKVFYC')
             CHGVAR     VAR(&CMD) VALUE('MOCKVERIFY')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKNMRC')
             CHGVAR     VAR(&CMD) VALUE('MOCKNOMORE')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKARGC')
             CHGVAR     VAR(&CMD) VALUE('MOCKGETARG')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKCNTC')
             CHGVAR     VAR(&CMD) VALUE('MOCKCOUNT')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKRSTC')
             CHGVAR     VAR(&CMD) VALUE('MOCKRESET')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKRMVC')
             CHGVAR     VAR(&CMD) VALUE('MOCKRMV')
             CALLSUBR   SUBR(BUILD)
             CHGVAR     VAR(&CPP) VALUE('MCKCHKC')
             CHGVAR     VAR(&CMD) VALUE('MOCKCHK')
             CALLSUBR   SUBR(BUILD)

             CHGVAR     VAR(&MSG) VALUE('IBMIMOCK installed in' *BCAT +
                          &LIB)
             IF         COND(*NOT &INLIBL) THEN(DO)
             RMVLIBLE   LIB(&LIB)
             MONMSG     MSGID(CPF0000)
             ENDDO
             SNDPGMMSG  MSGID(CPF9897) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*COMP)
             RETURN

 FAIL:       RCVMSG     MSGTYPE(*EXCP) RMV(*NO) MSG(&MSG)
             MONMSG     MSGID(CPF0000)
             CHGVAR     VAR(&MSG) VALUE('MOCKINST failed at' *BCAT +
                          &STEP *TCAT ':' *BCAT &MSG)
             MONMSG     MSGID(CPF0000)
             SNDPGMMSG  MSGID(CPF9898) MSGF(QCPFMSG) MSGDTA(&MSG) +
                          MSGTYPE(*ESCAPE)
             MONMSG     MSGID(CPF0000)
             RETURN

/* ---- compile one command processing program and its command ---- */
             SUBR       SUBR(BUILD)
             CHGVAR     VAR(&STEP) VALUE(&CPP)
             CRTCLMOD   MODULE(QTEMP/&CPP) SRCFILE(&SRCLIB/QCLLESRC) +
                          SRCMBR(&CPP)
             DLTPGM     PGM(&LIB/&CPP)
             MONMSG     MSGID(CPF2105)
             CRTPGM     PGM(&LIB/&CPP) MODULE(QTEMP/&CPP) +
                          BNDSRVPGM((&LIB/MOCKENG)) ACTGRP(*CALLER)
             DLTMOD     MODULE(QTEMP/&CPP)
             CHGVAR     VAR(&STEP) VALUE(&CMD)
             DLTCMD     CMD(&LIB/&CMD)
             MONMSG     MSGID(CPF2105)
             IF         COND(&CMD *EQ 'MOCKGETARG' *OR &CMD *EQ +
                          'MOCKCOUNT') THEN(DO)
             CRTCMD     CMD(&LIB/&CMD) PGM(&LIB/&CPP) +
                          SRCFILE(&SRCLIB/QCMDSRC) SRCMBR(&CMD) +
                          ALLOW(*IPGM *BPGM *IMOD *BMOD)
             ENDDO
             ELSE       CMD(DO)
             CRTCMD     CMD(&LIB/&CMD) PGM(&LIB/&CPP) +
                          SRCFILE(&SRCLIB/QCMDSRC) SRCMBR(&CMD)
             ENDDO
             ENDSUBR

/* ---- message file ------------------------------------------------ */
             SUBR       SUBR(MSGFILE)
             CHGVAR     VAR(&MSGF) VALUE('MOCKMSGF  ' *CAT &LIB)
             DLTMSGF    MSGF(&LIB/MOCKMSGF)
             MONMSG     MSGID(CPF2105)
             CRTMSGF    MSGF(&LIB/MOCKMSGF) TEXT('IBMIMOCK messages')
             ADDMSGD    MSGID(MCK0001) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(0) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0010) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('The object found first in the +
                          library list is not the mock in QTEMP, so +
                          the code under test would call the real +
                          object. The current library and product +
                          libraries are searched before QTEMP.') +
                          SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0011) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0012) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0013) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0014) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0015) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0020) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(20) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0021) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0100) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('A strict mock received a call that +
                          no MOCKWHEN matched.') SEV(40) +
                          FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0101) MSGF(&LIB/MOCKMSGF) +
                          MSG('Mock threw: &1') SECLVL('Escape message +
                          sent by MOCKWHEN THROW(*MOCK).') SEV(40) +
                          FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0200) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0201) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0202) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('&1') SEV(40) FMT((*CHAR 512))
             ADDMSGD    MSGID(MCK0300) MSGF(&LIB/MOCKMSGF) MSG('&1') +
                          SECLVL('A command run with mock() failed.') +
                          SEV(40) FMT((*CHAR 512))
             ENDSUBR
             ENDPGM
