**free
// ------------------------------------------------------------------
// MOCKENG_H - RPGMOCK engine internals (templates + prototypes)
// Used by the MOCKENG service program modules and its unit tests.
// Test authors should /copy MOCK_H instead.
// ------------------------------------------------------------------
/if defined(MOCKENG_H)
/eof
/endif
/define MOCKENG_H

dcl-c MOCK_MAXP 64;

// Parameter / return value layout
dcl-ds mock_def_t qualified template;
  type char(10);
  len int(10);
  dec int(10);
  passing char(6);
end-ds;

// Error returned to the CL command processing programs
dcl-ds mock_err_t qualified template;
  msgId char(7);
  msgfLib char(10);
  text char(512);
end-ds;

// Escape message a stub must send to its caller
dcl-ds mock_throw_t qualified template;
  msgId char(7);
  msgf char(10);
  msgfLib char(10);
  msgDta varchar(512);
end-ds;

// ---- Stub entry point (called by generated stubs) ----------------
dcl-pr mock_invoke int(10) extproc('MOCK_INVOKE');
  obj char(10) const;
  proc varchar(4096) const;
  parmCount int(10) value;
  parmPtrs pointer value;
  rtnPtr pointer value;
  thr likeds(mock_throw_t);
end-pr;

// ---- Codec (MOCKCDC) ---------------------------------------------
dcl-pr mock_normDef ind extproc('MOCK_NORMDEF');
  def likeds(mock_def_t);
  msg varchar(256);
end-pr;

dcl-pr mock_decode varchar(1024) extproc('MOCK_DECODE');
  ptr pointer value;
  def likeds(mock_def_t) const;
end-pr;

dcl-pr mock_encode ind extproc('MOCK_ENCODE');
  ptr pointer value;
  def likeds(mock_def_t) const;
  text varchar(1024) const;
  msg varchar(256);
end-pr;

dcl-pr mock_match ind extproc('MOCK_MATCH');
  matcher char(10) const;
  expected varchar(1024) const;
  state char(1) const;
  actual varchar(1024) const;
  def likeds(mock_def_t) const;
end-pr;

dcl-pr mock_isNumeric ind extproc('MOCK_ISNUMERIC');
  type char(10) const;
end-pr;

dcl-pr mock_rpgType varchar(64) extproc('MOCK_RPGTYPE');
  def likeds(mock_def_t) const;
end-pr;

dcl-pr mock_validMatcher ind extproc('MOCK_VALIDMATCHER');
  matcher char(10) const;
end-pr;

// ---- Source generation (MOCKGEN) ---------------------------------
dcl-pr mock_genPgm ind extproc('MOCK_GENPGM');
  obj char(10) const;
  parmCount int(10) value;
  msg varchar(512);
end-pr;

dcl-pr mock_genSrv ind extproc('MOCK_GENSRV');
  obj char(10) const;
  msg varchar(512);
end-pr;

dcl-pr mock_readExports ind extproc('MOCK_READEXPORTS');
  obj char(10) const;
  names varchar(4096) dim(2000);
  count int(10);
  msg varchar(512);
end-pr;

// ---- Public API for test programs (also in MOCK_H) ---------------
dcl-pr mock_run extproc('MOCK_RUN');
  cmd varchar(3000) const;
end-pr;

dcl-pr mock_ok ind extproc('MOCK_OK');
  cmd varchar(3000) const;
end-pr;

dcl-pr mock_lastError varchar(512) extproc('MOCK_LASTERROR') end-pr;

dcl-pr mock_arg varchar(1024) extproc('MOCK_ARG');
  obj char(10) const;
  proc varchar(4096) const;
  callNo int(10) const;
  parmNo int(10) const;
end-pr;

dcl-pr mock_count int(10) extproc('MOCK_COUNT');
  obj char(10) const;
  proc varchar(4096) const;
end-pr;
